In [1]:
import pandas as pd
import warnings
import psycopg2
warnings.filterwarnings('ignore')

In [2]:
try: 
    pg_conn = psycopg2.connect(
        host="localhost",
        database="uber_de",
        user="postgres", 
        password="Clarence2023!"
    )
    pg_conn.autocommit = True
    print("Connection to PG successful!")
except psycopg2.Error as e:
    print("Connection error:",e)

cursor = pg_conn.cursor()

Connection to PG successful!

In [3]:
df = pd.read_parquet(r'D:\My Project\DE_uber\Dataset\yellow_tripdata_2022-10.parquet')
df = df.head(30000)

In [4]:
df.columns

Index(['VendorID', 'tpep_pickup_datetime', 'tpep_dropoff_datetime',
       'passenger_count', 'trip_distance', 'RatecodeID', 'store_and_fwd_flag',
       'PULocationID', 'DOLocationID', 'payment_type', 'fare_amount', 'extra',
       'mta_tax', 'tip_amount', 'tolls_amount', 'improvement_surcharge',
       'total_amount', 'congestion_surcharge', 'airport_fee'],
      dtype='object')

In [5]:
df = df.drop_duplicates().reset_index(drop=True)
df['trip_id'] = df.index

In [6]:
df['tpep_dropoff_datetime'] = pd.to_datetime(df['tpep_dropoff_datetime'])
df['tpep_pickup_datetime'] = pd.to_datetime(df['tpep_pickup_datetime'])

datetime_dim = df[['tpep_pickup_datetime', 'tpep_dropoff_datetime']]
datetime_dim['pick_hour'] = datetime_dim['tpep_pickup_datetime'].dt.hour
datetime_dim['pick_day'] = datetime_dim['tpep_pickup_datetime'].dt.day
datetime_dim['pick_month'] = datetime_dim['tpep_pickup_datetime'].dt.month
datetime_dim['pick_year'] = datetime_dim['tpep_pickup_datetime'].dt.year
datetime_dim['pick_weekday'] = datetime_dim['tpep_pickup_datetime'].dt.weekday

datetime_dim['drop_hour'] = datetime_dim['tpep_dropoff_datetime'].dt.hour
datetime_dim['drop_day'] = datetime_dim['tpep_dropoff_datetime'].dt.day
datetime_dim['drop_month'] = datetime_dim['tpep_dropoff_datetime'].dt.month
datetime_dim['drop_year'] = datetime_dim['tpep_dropoff_datetime'].dt.year
datetime_dim['drop_weekday'] = datetime_dim['tpep_dropoff_datetime'].dt.weekday

datetime_dim['datetime_id'] = datetime_dim.index

datetime_dim = datetime_dim[['datetime_id', 'tpep_pickup_datetime', 'tpep_dropoff_datetime', 'pick_hour', 'pick_day', 'pick_month', 'pick_year', 'pick_weekday', 'drop_hour', 'drop_day', 'drop_month', 'drop_year', 'drop_weekday']]
datetime_dim.head()

,datetime_id,tpep_pickup_datetime,tpep_dropoff_datetime,pick_hour,pick_day,pick_month,pick_year,pick_weekday,drop_hour,drop_day,drop_month,drop_year,drop_weekday
0,0,2022-10-01 00:03:41,2022-10-01 00:18:39,0,1,10,2022,5,0,1,10,2022,5
1,1,2022-10-01 00:14:30,2022-10-01 00:19:48,0,1,10,2022,5,0,1,10,2022,5
2,2,2022-10-01 00:27:13,2022-10-01 00:37:41,0,1,10,2022,5,0,1,10,2022,5
3,3,2022-10-01 00:32:53,2022-10-01 00:38:55,0,1,10,2022,5,0,1,10,2022,5
4,4,2022-10-01 00:44:55,2022-10-01 00:50:21,0,1,10,2022,5,0,1,10,2022,5

In [7]:
passenger_count_dim = df[['passenger_count']].drop_duplicates().reset_index(drop=True)
passenger_count_dim['passenger_count_id']  = passenger_count_dim.index
passenger_count_dim = passenger_count_dim[['passenger_count_id','passenger_count']]
passenger_count_dim

   passenger_count_id  passenger_count
0                   0              1.0
1                   1              2.0
2                   2              0.0
3                   3              3.0
4                   4              4.0
5                   5              5.0
6                   6              6.0

In [8]:
trip_distance_dim = df[['trip_distance']].drop_duplicates().sort_values('trip_distance').reset_index(drop=True)
trip_distance_dim['trip_distance_id'] = trip_distance_dim.index
trip_distance_dim = trip_distance_dim[['trip_distance_id', 'trip_distance']]
trip_distance_dim

      trip_distance_id  trip_distance
0                    0           0.00
1                    1           0.01
2                    2           0.02
3                    3           0.03
4                    4           0.04
...                ...            ...
1916              1916          44.22
1917              1917          45.76
1918              1918          49.43
1919              1919          49.83
1920              1920          61.82

[1921 rows x 2 columns]

In [9]:
rate_code_dict = {
    1: "Standard Rate",
    2: "JFK",
    3: "Newark",
    4: "Nassau or Westchester",
    5: "Negotiated Fare",
    6: "Group Ride"
}

rate_code_dim = df[['RatecodeID']].drop_duplicates().reset_index(drop=True)
rate_code_dim['rate_code_id'] = rate_code_dim.index
rate_code_dim['rate_code_name'] = rate_code_dim['RatecodeID'].map(rate_code_dict)
rate_code_dim = rate_code_dim[['rate_code_id', 'RatecodeID', 'rate_code_name']]
rate_code_dim

   rate_code_id  RatecodeID         rate_code_name
0             0         1.0          Standard Rate
1             1         5.0        Negotiated Fare
2             2         4.0  Nassau or Westchester
3             3         2.0                    JFK
4             4         3.0                 Newark
5             5        99.0                    NaN
6             6         6.0             Group Ride

In [10]:
payment_method_dic ={
    1: "Credit Card",
    2: "Cash",
    3: "No Charge",
    4: "Dispute",
    5: "Unknown", 
    6: "Voided Trip"
}
payment_method_dim  = df[['payment_type']].drop_duplicates().reset_index(drop=True)
payment_method_dim['payment_method_id'] = payment_method_dim.index
payment_method_dim['payment_type_name'] = payment_method_dim['payment_type'].map(payment_method_dic)
payment_method_dim = payment_method_dim[['payment_method_id', 'payment_type', 'payment_type_name']]
payment_method_dim

   payment_method_id  payment_type payment_type_name
0                  0             1       Credit Card
1                  1             2              Cash
2                  2             4           Dispute
3                  3             3         No Charge

In [11]:
location_dic = pd.read_csv(r'D:\My Project\DE_uber\Dataset\taxi+_zone_lookup.csv')
location_dic.head()

   LocationID        Borough                     Zone service_zone
0           1            EWR           Newark Airport          EWR
1           2         Queens              Jamaica Bay    Boro Zone
2           3          Bronx  Allerton/Pelham Gardens    Boro Zone
3           4      Manhattan            Alphabet City  Yellow Zone
4           5  Staten Island            Arden Heights    Boro Zone

In [12]:
pickup_location_dim = df[['PULocationID']].drop_duplicates().sort_values('PULocationID').reset_index(drop=True)
pickup_location_dim['pickup_location_id'] = pickup_location_dim.index
pickup_location_dim['pickup_borough'] = pickup_location_dim['PULocationID'].map(location_dic.set_index('LocationID')['Borough'])
pickup_location_dim['pickup_zone'] = pickup_location_dim['PULocationID'].map(location_dic.set_index('LocationID')['Zone'])
pickup_location_dim['pickup_service_zone'] = pickup_location_dim['PULocationID'].map(location_dic.set_index('LocationID')['service_zone'])
pickup_location_dim.head()

,PULocationID,pickup_location_id,pickup_borough,pickup_zone,pickup_service_zone
0,1,0,EWR,Newark Airport,EWR
1,3,1,Bronx,Allerton/Pelham Gardens,Boro Zone
2,4,2,Manhattan,Alphabet City,Yellow Zone
3,7,3,Queens,Astoria,Boro Zone
4,10,4,Queens,Baisley Park,Boro Zone

In [13]:
dropoff_location_dim = df[['DOLocationID']].drop_duplicates().sort_values('DOLocationID').reset_index(drop=True)
dropoff_location_dim['dropoff_location_id'] = dropoff_location_dim.index
dropoff_location_dim['dropoff_borough'] = dropoff_location_dim['DOLocationID'].map(location_dic.set_index('LocationID')['Borough'])
dropoff_location_dim['dropoff_zone'] = dropoff_location_dim['DOLocationID'].map(location_dic.set_index('LocationID')['Zone'])
dropoff_location_dim['dropoff_service_zone'] = dropoff_location_dim['DOLocationID'].map(location_dic.set_index('LocationID')['service_zone'])
dropoff_location_dim.head()

,DOLocationID,dropoff_location_id,dropoff_borough,dropoff_zone,dropoff_service_zone
0,1,0,EWR,Newark Airport,EWR
1,3,1,Bronx,Allerton/Pelham Gardens,Boro Zone
2,4,2,Manhattan,Alphabet City,Yellow Zone
3,6,3,Staten Island,Arrochar/Fort Wadsworth,Boro Zone
4,7,4,Queens,Astoria,Boro Zone

In [14]:
fact_table = df.merge(passenger_count_dim, on='passenger_count') \
            .merge(trip_distance_dim, on='trip_distance') \
            .merge(rate_code_dim, on='RatecodeID') \
            .merge(pickup_location_dim, on='PULocationID') \
            .merge(dropoff_location_dim, on='DOLocationID') \
            .merge(datetime_dim, on='tpep_dropoff_datetime') \
            .merge(payment_method_dim, on='payment_type') \
[['VendorID', 'datetime_id', 'passenger_count_id', 'trip_distance_id', 'rate_code_id', 'pickup_location_id', 'dropoff_location_id', 'payment_method_id',
  'store_and_fwd_flag', 'fare_amount', 'extra','mta_tax', 'tip_amount', 'tolls_amount', 'improvement_surcharge',
    'total_amount', 'congestion_surcharge', 'airport_fee']]

fact_table.head()

,VendorID,datetime_id,passenger_count_id,trip_distance_id,rate_code_id,pickup_location_id,dropoff_location_id,payment_method_id,store_and_fwd_flag,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount,congestion_surcharge,airport_fee
0,1,0,0,169,0,164,94,0,N,9.5,3.00,0.5,2.65,0.0,0.3,15.95,2.5,0.00
1,1,394,0,169,0,164,94,0,N,9.5,3.00,0.5,2.65,0.0,0.3,15.95,2.5,0.00
2,1,0,0,814,0,88,206,0,N,24.5,4.25,0.5,0.00,0.0,0.3,29.55,2.5,1.25
3,1,394,0,814,0,88,206,0,N,24.5,4.25,0.5,0.00,0.0,0.3,29.55,2.5,1.25
4,1,5812,0,169,0,164,94,0,N,9.0,3.00,0.5,1.00,0.0,0.3,13.80,2.5,0.00

In [16]:
from sqlalchemy import create_engine

engine = create_engine('postgresql://postgres:Clarence20231@localhost:5432/uber_de')

fact_table.to_sql("fact_table", engine, if_exists='replace', index=True)
passenger_count_dim.to_sql("passenger_count_dimension", engine, if_exists='replace', index=False)
trip_distance_dim.to_sql("trip_distance_dimension", engine, if_exists='replace', index=False)
rate_code_dim.to_sql("rate_code_dimension", engine, if_exists='replace', index=False)
pickup_location_dim.to_sql("pickup_location_dimension", engine, if_exists='replace', index=False)
dropoff_location_dim.to_sql("dropoff_location_dimension", engine, if_exists='replace', index=False)
datetime_dim.to_sql("datetime_dimension", engine, if_exists='replace', index=False)
payment_method_dim.to_sql("payment_method_dimension", engine, if_exists='replace', index=False)

4

In [20]:
alter_passenger_dim = """ALTER TABLE passenger_count_dimension ADD PRIMARY KEY (passenger_count_id)"""
alter_distance_dim = """ALTER TABLE trip_distance_dimension ADD PRIMARY KEY (trip_distance_id)"""
alter_rate_dim = """ALTER TABLE rate_code_dimension ADD PRIMARY KEY (rate_code_id)"""
alter_pickup_dim = """ALTER TABLE pickup_location_dimension ADD PRIMARY KEY (pickup_location_id)"""
alter_dropoff_dim = """ALTER TABLE dropoff_location_dimension ADD PRIMARY KEY (dropoff_location_id)"""
alter_payment_dim = """ALTER TABLE payment_method_dimension ADD PRIMARY KEY (payment_method_id)"""
alter_datetime_dim = """ALTER TABLE datetime_dimension ADD PRIMARY KEY (datetime_id)"""

add_primary_key_list=  [alter_passenger_dim, alter_distance_dim, alter_rate_dim, alter_pickup_dim, alter_dropoff_dim, alter_payment_dim, alter_datetime_dim]
for table_pk in add_primary_key_list:
    cursor.execute(alter_datetime_dim)

In [21]:
alter_fact_table_pk = """ALTER TABLE fact_table ADD PRIMARY KEY (index)"""
alter_passenger_fk = """ALTER TABLE fact_table ADD CONSTRAINT fk_passenger_count_id FOREIGN KEY (passenger_count_id) REFERENCES passenger_count_dimension(passenger_count_id)"""
alter_distance_fk = """ALTER TABLE fact_table ADD CONSTRAINT fk_trip_distance_id FOREIGN KEY (trip_distance_id) REFERENCES trip_distance_dimension(trip_distance_id)"""
alter_rate_fk = """ALTER TABLE fact_table ADD CONSTRAINT fk_rate_code_id FOREIGN KEY (rate_code_id) REFERENCES rate_code_dimension(rate_code_id)"""
alter_pickup_fk = """ALTER TABLE fact_table ADD CONSTRAINT fk_pickup_location_id FOREIGN KEY (pickup_location_id) REFERENCES pickup_location_dimension(pickup_location_id)"""
alter_dropoff_fk = """ALTER TABLE fact_table ADD CONSTRAINT fk_dropoff_location_id FOREIGN KEY (dropoff_location_id) REFERENCES dropoff_location_dimension(dropoff_location_id)"""
alter_payment_fk = """ALTER TABLE fact_table ADD CONSTRAINT fk_payment_method_id FOREIGN KEY (payment_method_id) REFERENCES payment_method_dimension(payment_method_id)"""
alter_datetime_fk = """ALTER TABLE fact_table ADD CONSTRAINT fk_datetime_id FOREIGN KEY (datetime_id) REFERENCES datetime_dimension(datetime_id)"""

alter_fact_table_list = [alter_fact_table_pk, alter_passenger_fk, alter_distance_fk, alter_rate_fk, alter_pickup_fk, alter_dropoff_fk, alter_payment_fk, alter_datetime_fk]
for key in alter_fact_table_list:
    cursor.execute(key)

In [ ]:
# Top 10 pickup location based on number of trips
# Tips based on payment method
# Total number of trips by passenger count
# Average fare amount by hour of day

In [33]:
query = """
SELECT * FROM fact_table
"""

query2 = """ 
SELECT * FROM trip_distance_dimension"""

query3 = """
SELECT pickup_location_id, COUNT(pickup_location_id)
FROM fact_table
"""

In [56]:
# query_data = """
# SELECT p.pickup_zone, COUNT(f.pickup_location_id) as count
# FROM fact_table f
# JOIN pickup_location_dimension p 
# ON f.pickup_location_id = p.pickup_location_id
# GROUP BY p.pickup_zone
# ORDER BY count DESC
# LIMIT 10
# """

query_data = """ 
SELECT d.pick_weekday, d.pick_hour, avg(f.fare_amount) as total_fare
FROM  fact_table f
JOIN datetime_dimension d
ON d.datetime_id = f.datetime_id
GROUP BY d.pick_weekday, d.pick_hour
ORDER BY total_fare DESC
"""

# query_data = """ 
# SELECT p.payment_type_name , sum(f.fare_amount)
# JOIN payment_method_dimension p
# ON p.payment_method_id = f.payment_method_id
# GROUP BY p.payment_type_name
# ORDER BY p.payment_type_name
# """

cursor.execute(query_data)
rows= cursor.fetchall()
pg_fact = pd.DataFrame(rows)
pg_fact

    0   1          2
0   5  21  52.000000
1   4  21  25.000000
2   5   5  20.779043
3   5   6  18.605324
4   5   7  17.139698
5   4  14  15.000000
6   5   8  14.833975
7   5   4  14.501763
8   5   9  13.373070
9   5   0  13.292240
10  4  23  12.831897
11  5   1  12.583751
12  5   3  12.470857
13  5   2  12.424541
14  5  10  12.288049
15  5  11  11.666667
16  4  22   7.125000